Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: The water supply to a dishwashing machine shall be protected against backflow by an air gap that is integral with the machine or a backflow preventer shall be installed in accordance with Section 608.
fr_ca: L'alimentation en eau d'un lave-vaisselle doit être protégée contre le refoulement par un entrefer faisant partie intégrante de la machine ou un dispositif anti-refoulement doit être installé selon la section 608.

source: The width of a hallway shall be not less than 3 feet (914 mm).
fr_ca: La largeur d'un couloir ne doit pas être inférieure à 3 pieds [914 mm].

source: The width of each landing shall be not less than the door served.
fr_ca: La largeur de chaque palier ne doit pas être inférieure à celle de la porte desservie.

source: The width of joints between firebricks shall not be greater than 1/4 inch (6.4 mm).
fr_ca: La largeur des joints entre les briques réfractaires ne doit pas être supérieure à 1/4 po [6,4 mm].

source: The width of spiral stairways shall be in accordance with Section R311.7.10.1.
fr_ca: La largeur des escaliers en colimaçon doit être conforme à la section R311.7.10.1.

source: The width of the egress court shall be not less than the required capacity.
fr_ca: La largeur du vestibule d'évacuation ne doit pas être inférieure à la capacité requise.

source: The width of the uppercase letter “O” of the font shall be 55 percent minimum and 110 percent maximum of the height of the uppercase “I” of the font.
fr_ca: La largeur de la lettre majuscule « O » de la police doit être d'au moins 55 pour cent et d'au plus 110 pour cent de la hauteur de la lettre majuscule « I » de la police.

source: The width perpendicular to the direction of travel shall be not less than the width of the flight served.
fr_ca: La largeur perpendiculaire au sens du parcours ne doit pas être inférieure à la largeur de la volée desservie.

source: The work surface shall be 34 inches (865 mm) maximum above the floor.
fr_ca: La surface de travail doit se situer à une hauteur maximale au-dessus du sol de 34 po [865 mm].

source: The work surface shall be located in accordance with Section 804.5.5.2 or 804.5.5.3.
fr_ca: Le plan de travail doit être situé selon la section 804.5.5.2 ou 804.5.5.3.

source: There shall be a floor or landing at the top and bottom of each stairway.
fr_ca: Il doit y avoir un étage ou un palier au haut et au bas de chaque escalier.

source: There shall be a landing or floor on each side of each exterior door.
fr_ca: Il doit y avoir un palier ou un étage de chaque côté de chaque porte extérieure.

source: There shall be a wall switch at each floor level to control the light source where the stairway has six or more risers.
fr_ca: Il doit y avoir un interrupteur mural à chaque niveau de plancher pour commander la source de lumière lorsque l'escalier comporte six contremarches ou plus.

source: There shall be no sharp or abrasive surfaces under sinks.
fr_ca: Il ne doit pas y avoir de surfaces acérées ou abrasives sous les éviers.

source: There shall be no sharp or abrasive surfaces under the exposed portions of work surface counters.
fr_ca: Il ne doit pas y avoir de surfaces acérées ou abrasives sous les parties exposées des comptoirs de surface de travail.

source: There shall not be obstructions in the minimum width or required capacity of aisles.
fr_ca: Il ne doit pas y avoir d'obstacles dans la largeur minimale ou la capacité requise des allées.

source: There shall not be penetrations or communicating openings, whether protected or not, between adjacent exit passageways.
fr_ca: Il ne doit pas y avoir de pénétrations ou d'ouvertures de communication, protégées ou non, entre les passages d'évacuation adjacents.

source: There shall not be penetrations or communication openings, whether protected or not, between adjacent interior exit stairways and ramps.
fr_ca: Il ne doit pas y avoir de pénétrations ou d'ouvertures de communication, protégées ou non, entre les escaliers et les rampes d'issue intérieurs adjacents.

source: Thermal and acoustical insulation shall comply with Section 720.
fr_ca: L’isolation thermique et acoustique doit être conforme à la section 720.

source: These areas shall not be considered to be floors, stories, mezzanines or levels in applying this code.
fr_ca: Ces aires ne doivent pas être considérées comme des planchers, des étages, des mezzanines ou des niveaux dans l'application du présent code.

source: These directional sign characters shall meet the visual character requirements in accordance with ICC A117.1.
fr_ca: Ces caractères de panneaux directionnels doivent satisfaire aux exigences relatives aux caractères visuels conformément à la norme ICC A117.1.

source: These directional signs shall include the International Symbol of Accessibility and sign characters shall meet the visual character requirements in accordance with ICC A117.1.
fr_ca: Ces panneaux directionnels doivent inclure le Symbole international d'accessibilité et les caractères du panneau doivent répondre aux exigences relatives aux caractères visuels conformément à la norme ICC A117.1.

source: These fixtures shall be in a single toilet/bathing area, such that travel between fixtures does not require travel through other parts of the unit.
fr_ca: Ces appareils sanitaires doivent se trouver dans une seule zone de toilettes/salle de bain, de sorte que le déplacement entre les appareils sanitaires ne nécessite pas de traverser d'autres parties de l'unité.

source: These gaps or breaks shall have a clear width of not less than 22 inches (559 mm) and not greater than 36 inches (914 mm), measured horizontally, and the mid-aisle handrail shall have rounded terminations or bends.
fr_ca: Ces écarts ou interruptions doivent avoir une largeur libre d’au moins 22 po (559 mm) et d’au plus 36 po (914 mm), mesurée horizontalement, et les mains courantes intermédiaires de l’allée doivent avoir des extrémités ou des coudes arrondis.

source: These locations supersede the locations specified in NFPA 720.
fr_ca: Ces emplacements remplacent les emplacements spécifiés dans la norme NFPA 720.

source: These toilet and bathing fixtures shall be in a single toilet/bathing area, such that travel between fixtures does not require travel through other parts of the unit.
fr_ca: Ces appareils sanitaires de toilettes et de salle de bain doivent se trouver dans une seule zone de toilettes/salle de bain, de sorte que le déplacement entre les appareils ne nécessite pas de traverser d'autres parties de l'unité.

source: They shall not be installed in locations where the code requires carbon monoxide detectors to be used.
fr_ca: Elles ne doivent pas être installées dans des endroits où le code exige l'utilisation de détecteurs de monoxyde de carbone.

source: Thickness
fr_ca: Épaisseur

source: Thickness of wall of firebox
fr_ca: Épaisseur de la paroi de la chambre de combustion

source: Thirty inches (762 mm) where the aisle serves fewer than 15 seats and does not serve as part of an accessible route.
fr_ca: Trente pouces (762 mm) lorsque l'allée dessert moins de 15 sièges et ne fait pas partie d'un itinéraire accessible.

source: Thirty-six inches (914 mm) where the stepped aisles serve less than 50 seats.
fr_ca: Trente-six pouces (914 mm) lorsque les allées en escalier desservent moins de 50 sièges.

source: This Section does not apply to the following buildings and spaces:
fr_ca: Cet article ne s'applique pas aux bâtiments et aux espaces suivants :

source: This Section shall apply to common interior walls, partitions and floor/ceiling assemblies between adjacent dwelling units and sleeping units or between dwelling units and sleeping units and adjacent public areas.
fr_ca: La présente section s’applique aux murs intérieurs, cloisons et ensembles plancher-plafond communs entre des logements et des unités d’habitation destinées au sommeil adjacents, ou entre des logements et des unités d’habitation destinées au sommeil et des aires publiques adjacentes.

source: This code shall not require changes in the construction documents, construction or designated occupancy of a structure for which a lawful permit has been heretofore issued or otherwise lawfully authorized, and the construction of which has been pursued in good faith within 180 days after the effective date of this code and has not been abandoned.
fr_ca: Le présent code n’exige aucune modification des documents de construction, de la construction ou de l’usage désigné d’une construction pour laquelle un permis légal a été délivré antérieurement ou qui a autrement été autorisée légalement, et dont la construction a été poursuivie de bonne foi dans les 180 jours suivant la date d’entrée en vigueur du présent code et n’a pas été abandonnée.

source: This construction shall extend vertically from the ground to a point 10 feet (3048 mm) above the floor of the exit passageway, or to the roof line, whichever is lower.
fr_ca: Cette construction doit se prolonger verticalement depuis le sol jusqu'à un point situé à 10 pi (3048 mm) au-dessus du sol du passage d'issue, ou jusqu'à la ligne du toit, selon la valeur la plus basse.

source: This construction shall extend vertically from the ground to a point 10 feet (3048 mm) above the topmost landing of the stairway or ramp, or to the roof line, whichever is lower.
fr_ca: Cette construction doit se prolonger verticalement depuis le sol jusqu'à un point situé à 10 pi (3048 mm) au-dessus du palier le plus haut de l'escalier ou de la rampe, ou jusqu'à la ligne du toit, selon la plus basse des deux.

source: This exception shall not apply to cars with doors on adjacent sides.
fr_ca: Cette exception ne doit pas s'appliquer aux cabines dont les portes sont situées sur des côtés adjacents.

source: This exception shall not apply to door or gates with ramps.
fr_ca: Cette exception ne s'applique pas aux portes ou aux portails avec des rampes.

source: This exception shall not apply to doors or gates with ramps.
fr_ca: Cette exception ne doit pas s'appliquer aux portes ou aux portillons avec des rampes.

source: This exception shall not apply to:
fr_ca: Cette exception ne s'applique pas :

source: This group shall include, but not be limited to, the following:
fr_ca: Ce groupe comprend notamment les éléments suivants :

source: This marking shall be located behind, immediately adjacent to, or on the door handle or escutcheon.
fr_ca: Ce marquage doit être situé derrière, immédiatement adjacent à, ou sur la poignée ou la rosace de la porte.

source: This means shall not be self-resetting.
fr_ca: Ce moyen ne doit pas être à réarmement automatique.

source: This occupancy condition shall include buildings in which all persons receiving custodial care, without any assistance, are capable of responding to an emergency situation to complete building evacuation.
fr_ca: Cette catégorie d’occupation comprend les bâtiments dans lesquels toutes les personnes recevant des soins de garde sont capables, sans aucune assistance, de réagir à une situation d’urgence afin d’évacuer complètement le bâtiment.

source: This occupancy condition shall include buildings in which there are any persons receiving custodial care who require limited verbal or physical assistance while responding to an emergency situation to complete building evacuation.
fr_ca: Cette catégorie d’occupation comprend les bâtiments dans lesquels certaines personnes recevant des soins de garde ont besoin d’une assistance verbale ou physique limitée pour réagir à une situation d’urgence afin d’évacuer complètement le bâtiment.

source: This provision is not applicable to toilet areas located within Group I-3 occupancy housing areas.
fr_ca: Cette disposition ne s'applique pas aux zones de toilettes situées dans les zones d'habitation du groupe I-3.

source: This provision shall also apply where mirrors would compromise personal privacy.
fr_ca: Cette disposition s’applique également lorsque des miroirs compromettraient l’intimité des personnes.

source: This requirement shall not apply to electrical equipment, wiring, wheels, handrails and the use of 1/28-inch (0.9 mm) wood veneers on balustrades backed up with non-combustible materials.
fr_ca: Cette exigence ne s’applique pas au matériel électrique, au câblage, aux roues, aux mains courantes ni à l’utilisation de placages de bois de 1/28 po (0,9 mm) sur des balustrades dont le support est constitué de matériaux incombustibles.

source: This requirement shall not apply to entrance doors; however, such doors shall be tight fitting to the frame and sill.
fr_ca: Cette exigence ne s’applique pas aux portes d’entrée; toutefois, ces portes doivent être parfaitement ajustées au cadre et au seuil.

source: This section covers the application, installation, performance and maintenance of fire alarm systems and their components.
fr_ca: Cette section couvre l'application, l'installation, la performance et l'entretien des systèmes d'alarme d'incendie et de leurs composants.

source: This section is not applicable to toilet and bathing rooms that serve dwelling units or sleeping units that are not required to be accessible by Section 1107.
fr_ca: La présente section ne s’applique pas aux cabinets de toilette et salles de bain qui desservent des logements ou des unités de couchage qui ne sont pas tenus d’être accessibles conformément à la section 1107.

source: This section shall apply both to exposed foam plastics and to foam plastics used in conjunction with a textile or vinyl facing or cover.
fr_ca: Cette section s’applique à la fois aux mousses plastiques exposées et aux mousses plastiques utilisées avec un revêtement ou une couverture en textile ou en vinyle.

source: This shall apply to single glazing and all panes in multiple glazing.
fr_ca: Cela s'applique au vitrage simple et à toutes les vitres dans le cas d'un vitrage multiple.

source: This shall apply to single glazing and each pane in multiple glazing.
fr_ca: Cela s'applique au vitrage simple et à chaque vitre dans le cas d'un vitrage multiple.

source: This table does not cover all requirements, nor does it cover all aspects of the indicated requirements.
fr_ca: Ce tableau ne couvre pas toutes les exigences, ni tous les aspects des exigences indiquées.

source: This table provides a summary of major requirements for the construction of masonry chimneys and fireplaces.
fr_ca: Ce tableau fournit un résumé des principales exigences pour la construction de cheminées et de foyers en maçonnerie.

source: Those portions of aisles, where egress is possible in either of two directions, shall be uniform in minimum width or required capacity.
fr_ca: Les parties des allées où l'évacuation est possible dans l'une ou l'autre de deux directions doivent être uniformes en largeur minimale ou en capacité requise.

source: Thresholds at exterior sliding doors shall be permitted to be 3/4 inch (19 mm) maximum in height, provided they are beveled with a slope not greater than 1:2.
fr_ca: Les seuils des portes coulissantes extérieures peuvent avoir une hauteur maximale de 3/4 po [19 mm], à condition qu'ils soient biseautés avec une pente maximale de 1:2.

source: Thresholds at exterior sliding doors shall be permitted to be 3/4 inch (19 mm) maximum in height, provided they are beveled with a slope not steeper than 1:2.
fr_ca: Les seuils des portes coulissantes extérieures peuvent avoir une hauteur maximale de 3/4 pouce (19 mm), à condition d’être biseautés avec une pente d’au plus 1:2.

source: Thresholds shall comply with Section 303.
fr_ca: Les seuils doivent être conformes à la section 303.

source: Ticket booths less than 100 square feet (9.29 m2) in area.
fr_ca: Guichets de billets d'une superficie inférieure à 100 pi2 (9,29 m2).

source: To be considered open, the opening shall be not less than 50 percent of the height of the enclosing wall, with the top of the openings not less than 7 feet (2134 mm) above the top of the balcony.
fr_ca: Pour être considérée comme ouverte, l'ouverture ne doit pas être inférieure à 50 pour cent de la hauteur du mur d'enceinte, le haut des ouvertures ne devant pas être inférieur à 7 pi (2134 mm) au-dessus du haut du balcon.

source: To facilitate smoke removal in post-fire salvage and overhaul operations, buildings and structures shall be equipped with natural or mechanical ventilation for removal of products of combustion in accordance with one of the following:
fr_ca: Pour faciliter l’évacuation de la fumée lors des opérations de récupération et de remise en état après un incendie, les bâtiments et les constructions doivent être équipés d’une ventilation naturelle ou mécanique permettant l’évacuation des produits de combustion conformément à l’une des dispositions suivantes :

source: To obtain a permit, the applicant shall first file an application therefore in writing on a form furnished by the department of building safety for that purpose.
fr_ca: Pour obtenir un permis, le demandeur doit d’abord présenter une demande écrite à cet effet sur un formulaire fourni par le service de la sécurité des bâtiments à cette fin.

source: Toilet and bathing fixtures shall comply with Section 1104.11.
fr_ca: Les appareils sanitaires de toilettes et de bain doivent être conformes à la section 1104.11.

source: Toilet rooms located in child day care facilities and containing two or more urinals shall be permitted to have one urinal without partitions.
fr_ca: Dans les salles de toilettes de garderies comportant deux urinoirs ou plus, il peut y avoir un urinoir sans cloison.

source: Toilet rooms located in child day care facilities and containing two or more water closets shall be permitted to have one water closet without an enclosing compartment.
fr_ca: Dans les salles de toilettes situées dans les garderies et contenant deux toilettes ou plus, il peut y avoir une toilette sans compartiment fermé.

source: Toilet rooms or bathing rooms accessed only through a private office, not for common or public use and intended for use by a single occupant, shall be permitted to comply with the specific exceptions in ICC A117.1.
fr_ca: Les toilettes ou les salles de bain accessibles uniquement par un bureau privé, qui ne sont pas destinés à un usage commun ou public et qui sont destinés à être utilisés par un seul occupant, peuvent être conformes aux exceptions particulières prévues dans la norme ICC A117.1.

source: Toilet rooms or bathing rooms designed for bariatrics patients are not required to comply with the toilet room and bathing room requirement in ICC A117.1.
fr_ca: Les salles de toilettes ou les salles de bain conçues pour les patients bariatriques ne sont pas tenues de respecter les exigences de la norme ICC A117.1 en matière de toilettes et de salles de bain.

source: Toilet rooms or bathing rooms that are part of critical care or intensive care patient sleeping rooms serving Accessible units are not required to be accessible.
fr_ca: Les salles de toilettes ou salles de bain qui font partie des chambres de patients en soins intensifs desservant des unités accessibles ne sont pas tenues d’être accessibles.

source: Toilet rooms that are not accessible to the public and that have not more than one water closet.
fr_ca: Toilettes qui ne sont pas accessibles au public et n'ont pas plus d'une cabine de toilette.

source: Toilet rooms.
fr_ca: Salles de toilettes.

source: Top loading machines shall have the door to the laundry compartment 36 inches (915 mm) maximum above the floor.
fr_ca: La porte du compartiment à linge des machines à chargement par le haut doit se trouver à une hauteur maximale de 36 po [915 mm] au-dessus du sol.

source: Top of gripping surfaces of handrails shall be 34 inches (865 mm) minimum and 38 inches (965 mm) maximum vertically above stair nosings, ramp surfaces and walking surfaces.
fr_ca: Le haut des surfaces de préhension des rampes doit se situer entre 34 po [865 mm] et 38 po [965 mm] verticalement au-dessus des nez de marche, des surfaces de rampe et des surfaces de circulation.

source: Total seating in Assembly Areas
fr_ca: Nombre total de places assises dans les zones de réunion

source: Transfer-type shower compartments shall comply with Section 608.2.1.
fr_ca: Les compartiments de douche de type transfert doivent être conformes à la section 608.2.1.

source: Transitions between stairways and stepped aisles having different riser and tread dimensions shall comply with Sections 1030.10.2.1 through 1030.10.3.
fr_ca: Les transitions entre les escaliers et les allées à gradins présentant des dimensions différentes de contremarches et de marches doivent être conformes aux sections 1030.10.2.1 à 1030.10.3.

source: Transitions between stairways and stepped aisles shall comply with Section 1030.10.
fr_ca: Les transitions entre les escaliers et les allées en gradins doivent être conformes à la section 1030.10.

source: Transitions between stairways and stepped aisles shall comply with either Section 1030.10.1 or 1030.10.2.
fr_ca: Les transitions entre les escaliers et les allées à gradins doivent être conformes à la section 1030.10.1 ou 1030.10.2.

source: Transitions between the stepped aisle above a vomitory and stepped aisles to the side of a vomitory shall have a depth of not less than 11 inches (280 mm) or the stepped aisle tread depth, whichever is greater.
fr_ca: Les transitions entre l’allée à gradins située au-dessus d’un vomitoire et les allées à gradins situées sur les côtés d’un vomitoire doivent avoir une profondeur d’au moins 11 po (280 mm) ou égale à la profondeur des marches de l’allée à gradins, selon la plus grande de ces valeurs.

source: Transitions where the stairway changes direction from the stepped aisle shall have a minimum depth of 11 inches (280 mm) or the stepped aisle tread depth, whichever is greater, between the stepped aisle and stairway.
fr_ca: Les transitions lorsque l’escalier change de direction par rapport à l’allée à gradins doivent avoir une profondeur minimale de 11 po (280 mm) ou égale à la profondeur des marches de l’allée à gradins, selon la plus grande de ces valeurs, entre l’allée à gradins et l’escalier.

source: Tread depths shall be not less than 11 inches (279 mm) and shall have dimensional uniformity.
fr_ca: La profondeur des girons ne doit pas être inférieure à 11 po (279 mm) et leurs dimensions doivent être uniformes.

source: Treads shall be 11 inches (280 mm) minimum in depth.
fr_ca: La profondeur minimale des marches doit être de 11 po [280 mm].

source: Twenty-three inches (584 mm) between a stepped aisle handrail and seating where a stepped aisle does not serve more than five rows on one side.
fr_ca: Vingt-trois pouces (584 mm) entre une main courante d'allée en escalier et des sièges lorsqu'une allée en escalier ne dessert pas plus de cinq rangées d'un côté.

source: Two
fr_ca: Deux

source: Two 3/16-inch by 1-inch (5 mm by 25 mm) straps shall be embedded not less than 12 inches (305 mm) into the chimney.
fr_ca: Deux sangles de 3/16 po par 1 po [5 mm par 25 mm] doivent être encastrées à au moins 12 po [305 mm] dans la cheminée.

source: Two connections to the same main shall be permitted provided that the main is valved such that an interruption can be isolated so that the water supply will continue without interruption through not fewer than one of the connections.
fr_ca: Deux raccordements à la même conduite principale sont autorisés à condition que celle-ci soit munie de vannes permettant d’isoler une interruption de manière à ce que l’alimentation en eau puisse se poursuivre sans interruption par au moins l’un des raccordements.
